Tekla Open API Reference for Tekla Structures 2025
View.CreateSectionView Method
 Generates a new section view on the sheet of the active drawing and the associated section mark for the specified view.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool CreateSectionView(
	View view,
	Point startPoint,
	Point endPoint,
	Point viewInsertionPoint,
	double depthUp,
	double depthDown,
	View.ViewAttributes viewAttributes,
	SectionMarkBase.SectionMarkAttributes sectionMarkAttributes,
	out View sectionView,
	out SectionMark sectionMark
)
Public Shared Function CreateSectionView (
	view As View,
	startPoint As Point,
	endPoint As Point,
	viewInsertionPoint As Point,
	depthUp As Double,
	depthDown As Double,
	viewAttributes As View.ViewAttributes,
	sectionMarkAttributes As SectionMarkBase.SectionMarkAttributes,
	<OutAttribute> ByRef sectionView As View,
	<OutAttribute> ByRef sectionMark As SectionMark
) As Boolean
Parameters
view
Type: Tekla.Structures.Drawing.View
The view in which to place the section mark.
startPoint
Type: Tekla.Structures.Geometry3d.Point
The starting point of the section mark.
endPoint
Type: Tekla.Structures.Geometry3d.Point
The ending point of the section mark.
viewInsertionPoint
Type: Tekla.Structures.Geometry3d.Point
The point where to create the section view.
depthUp
Type: System.Double
The view depth up that the section view should cover.
depthDown
Type: System.Double
The view depth down that the section view should cover.
viewAttributes
Type: Tekla.Structures.Drawing.View.ViewAttributes
The attributes for the section view to be created.
sectionMarkAttributes
Type: Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes
The attributes for the section mark to be created.
sectionView
Type: Tekla.Structures.Drawing.View
 The created section view is returned if the creation was successful. Otherwise, null is returned.
sectionMark
Type: Tekla.Structures.Drawing.SectionMark
 The created section mark is returned if the creation was successful. Otherwise, null is returned.
Return Value
Type: Boolean
True if the section view was created successfully.
See Also
Reference
View Class
Tekla.Structures.Drawing Namespace